{
	"subtitle": "Welcome to my portfolio website!",
	"intro": "Hi! I'm <strong>{{name}}</strong>! And this is the place where you can know about me, so make yourself at home! I'm a software engineer placed in Malaga, in the south of Spain. I started my working career when I was 23 (back in 2016) and since then I've been working in different fields and areas. But before getting down to business, here it is a little bit about me!",
	"section1": "I was born in 1993 in Malaga, and I live in Fuengirola (30km away from the capital)! Since I was a child, I've been always interested in technology. The first computer that we had in my parents home was an {{ pentium }} running <code>Windows 98</code>. And now, I could say that I spent all my childhood learning coding stuff but I would be a lying... I was most of the time playing games like {{ jazz }}!",
	"section2": "Nowadays, I love to practice sports, any kind of sports. My favorite is soccer ⚽, although over the years I've moved on to watching it at the bar rather than playing it. I also like to play padel from time to time, as I'm a bit old for tennis. And on a daily basis I do strength or functional training at the gym!",
	"section3": "I still play video games whenever I have some free time! As a teenager I was more into <code>MMORPGs</code> like Guild Wars or WoW along with Counter Strike, but nowadays I've moved to the world of consoles. I alternate my games on the {{ nintendo}} with some others on the {{ xbox }}. I can say the two videogame sagas that have marked me the most are <code>The Legend of Zelda</code> (I've played ALL of them) and the <code>Dark Souls</code> saga...",
	"section4": "I really like to keep learning outside of work about technology stacks that I don't know yet, or keep learning about new programming languages. So I could say that programming is my job but also my hobby! Thanks to it, I have been able to learn (and then even work from it in many cases) about Machine Learning, web development or software architectures."
}
