{
	"subtitle": "Bienvenido a mi portfolio!",
	"intro": "Hola! soy <strong>{{name}}</strong>! Y este es el lugar perfecto para saber un poco de mi, así que ponte cómodo! Soy un ingeniero de software que vive en Málaga, en la parte de sur de España. Empecé a trabajar en el mundo del software en 2016 (con unos 23 años) y desde entonces he estado en trabajos relacionados con distintas tecnologias y áreas. Pero antes de ponernos manos a la obra, déjame contarte un poco sobre mi!",
	"section1": "Nací en 1993 en Málaga, y vivo en Fuengirola (a unos 30km de la capital)! Desde que era un niño, siempre estuve interesado en la tecnología. El primer ordenador que tuvimos en casa fue un {{ pentium }} corriendo <code>Windows 98</code>. Y aquí podría decir que fui el típico niño que estuvo toda su infancia aprendiendo a programar... pero en realidad lo que mas hacía era jugar al {{ jazz }}!",
	"section2": "A día de hoy, me encanta hacer deporte, cualquier tipo de deporte prácticamente. Mi favorito es el fútbol ⚽, aunque con los años he pasado a verlo en el bar más que a jugarlo. También me gusta jugar de vez en cuando al padel, que para el tenis ya estoy algo mayor. Y en el día a día hago entrenamientos de fuerza o funcionales en el gimnasio!",
	"section3": "Sigo jugando videojuegos siempre que tengo algo de tiempo libre! En la adolescencia fui mas de <code>MMORPGs</code> como Guild Wars o WoW junto con Counter Strike, pero a dia de hoy me he pasado al mundo de las consolas. Alterno mis partidas en la {{ nintendo}} con otras tantas en la {{ xbox }}. Creo que las dos sagas de videojuegos que mas me han marcado son <code>The Legend of Zelda</code> (he jugado a TODAS las entregas) y la saga <code>Dark Souls</code>...",
	"section4": "Me gusta mucho seguir aprendiendo fuera del trabajo sobre stacks tecnológicos que aún no conozco, o seguir aprendiendo sobre nuevos lenguajes de programación. Por lo que podría decir que la programación es mi trabajo pero también mi hobby! Gracias a ello, he podido aprender (y después incluso trabajar de ello en muchos casos) sobre Machine Learning, desarrollo web o arquitecturas de software."
}
